## 시리즈 만들기

In [1]:
import pandas as pd
import numpy as np
s=pd.Series([1,2,3,4])  
s

0    1
1    2
2    3
3    4
dtype: int64

## 데이터프레임 만들기

In [2]:
data = { "name":["a","b","c","d"],
         "height":[170,164,161,178]}
df=pd.DataFrame(data)
df

  name  height
0    a     170
1    b     164
2    c     161
3    d     178

## 데이터프레임에서 시리즈 선택하기

In [3]:
df["height"]

0    170
1    164
2    161
3    178
Name: height, dtype: int64

## index, values 사용하기

In [4]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
df.values

array([['a', 170],
       ['b', 164],
       ['c', 161],
       ['d', 178]], dtype=object)

## 시리즈의 mean, min, max, std 메서드 사용하기

In [6]:
s.mean()

2.5

In [7]:
s.min()

1

In [8]:
s.max()

4

In [9]:
s.std()

1.2909944487358056

## 시리즈와 불린 추출 사용하기

In [15]:
scientists = pd.read_csv('scientists.csv')
scientists
#age열 평균 구하고 평균보다 큰 age만 추출 
scientists["Age"].mean()
scientists[scientists.Age>scientists["Age"].mean()]["Age"]


scientists[scientists['Age']>scientists['Age'].mean()]['Age']

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

## 시리즈와 브로드캐스팅

In [21]:
#age열에 대해 모두 +10 *2 ... 연산
scientists
#시리즈와 스칼라 연산
list(scientists['Age'] +10) *2

[47, 71, 100, 76, 66, 55, 51, 87, 47, 71, 100, 76, 66, 55, 51, 87]

## 열의 자료형 바꾸기와 새로운 열 추가하기

In [32]:
scientists.astype({'Age':'float'})


scientists['data']='big~'
scientists

                   Name        Born        Died Age          Occupation  data
0     Rosaline Franklin  1920-07-25  1958-04-16  37             Chemist  big~
1        William Gosset  1876-06-13  1937-10-16  61        Statistician  big~
2  Florence Nightingale  1820-05-12  1910-08-13  90               Nurse  big~
3           Marie Curie  1867-11-07  1934-07-04  66             Chemist  big~
4         Rachel Carson  1907-05-27  1964-04-14  56           Biologist  big~
5             John Snow  1813-03-15  1858-06-16  45           Physician  big~
6           Alan Turing  1912-06-23  1954-06-07  41  Computer Scientist  big~
7          Johann Gauss  1777-04-30  1855-02-23  77       Mathematician  big~

In [24]:
scientists.dtypes
scientists['Age'] = scientists['Age'].astype(str)
scientists.dtypes

Name          object
Born          object
Died          object
Age           object
Occupation    object
data          object
dtype: object

## 데이터프레임의 열 삭제하기

In [33]:
del scientists['data']
scientists

                   Name        Born        Died Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16  37             Chemist
1        William Gosset  1876-06-13  1937-10-16  61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13  90               Nurse
3           Marie Curie  1867-11-07  1934-07-04  66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14  56           Biologist
5             John Snow  1813-03-15  1858-06-16  45           Physician
6           Alan Turing  1912-06-23  1954-06-07  41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23  77       Mathematician